#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>
```

Success! The configuration is valid.


```
</details>
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

google_project.default: Refreshing state... [id=projects/saas-starter-a1]
google_project_service.service["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=saas-starter-a1/cloudresourcemanager.googleapis.com]
google_service_account.github_actions: Refreshing state... [id=projects/saas-starter-a1/serviceAccounts/github-actions@saas-starter-a1.iam.gserviceaccount.com]
google_project_service.service["sts.googleapis.com"]: Refreshing state... [id=saas-starter-a1/sts.googleapis.com]
google_project_service.service["iamcredentials.googleapis.com"]: Refreshing state... [id=saas-starter-a1/iamcredentials.googleapis.com]
google_project_service.service["iam.googleapis.com"]: Refreshing state... [id=saas-starter-a1/iam.googleapis.com]
google_project_service.init["serviceusage.googleapis.com"]: Refreshing state... [id=saas-starter-a1/serviceusage.googleapis.com]
google_project_service.init["firebase.googleapis.com"]: Refreshing state... [id=saas-starter-a1/firebase.googleapis.com]
google_project_iam_member.roles["roles/resourcemanager.projectIamAdmin"]: Refreshing state... [id=saas-starter-a1/roles/resourcemanager.projectIamAdmin/serviceAccount:github-actions@saas-starter-a1.iam.gserviceaccount.com]
google_project_iam_member.roles["roles/editor"]: Refreshing state... [id=saas-starter-a1/roles/editor/serviceAccount:github-actions@saas-starter-a1.iam.gserviceaccount.com]
google_firebase_project.default: Refreshing state... [id=projects/saas-starter-a1]
google_iam_workload_identity_pool.github: Refreshing state... [id=projects/saas-starter-a1/locations/global/workloadIdentityPools/github]
google_service_account_iam_member.github_actions: Refreshing state... [id=projects/saas-starter-a1/serviceAccounts/github-actions@saas-starter-a1.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/179248069986/locations/global/workloadIdentityPools/github/attribute.repository/devomr/saas-starter]
google_iam_workload_identity_pool_provider.github: Refreshing state... [id=projects/saas-starter-a1/locations/global/workloadIdentityPools/github/providers/github-provider]
google_project_service.storage["firebasestorage.googleapis.com"]: Refreshing state... [id=saas-starter-a1/firebasestorage.googleapis.com]
google_project_service.firestore["firebaserules.googleapis.com"]: Refreshing state... [id=saas-starter-a1/firebaserules.googleapis.com]
google_project_service.firestore["firestore.googleapis.com"]: Refreshing state... [id=saas-starter-a1/firestore.googleapis.com]
google_firebase_web_app.default: Refreshing state... [id=projects/saas-starter-a1/webApps/1:179248069986:web:b1ac8c0c810232af1f803b]
google_project_service.storage["storage.googleapis.com"]: Refreshing state... [id=saas-starter-a1/storage.googleapis.com]
google_firestore_database.default: Refreshing state... [id=projects/saas-starter-a1/databases/(default)]
google_firebaserules_ruleset.firestore: Refreshing state... [id=projects/saas-starter-a1/rulesets/48069a00-baab-4454-b3c5-d517f816a142]
google_app_engine_application.default: Refreshing state... [id=saas-starter-a1]
google_firebaserules_release.firestore: Refreshing state... [id=projects/saas-starter-a1/releases/cloud.firestore]
google_firebase_storage_bucket.default-bucket: Refreshing state... [id=projects/saas-starter-a1/buckets/saas-starter-a1.appspot.com]
google_firebaserules_ruleset.storage: Refreshing state... [id=projects/saas-starter-a1/rulesets/f9f8ae3a-6c98-42dc-8b27-0b9d7d02313e]
google_firebaserules_release.default-bucket: Refreshing state... [id=projects/saas-starter-a1/releases/firebase.storage/saas-starter-a1.appspot.com]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_firebaserules_release.default-bucket will be replaced due to changes in replace_triggered_by
-/+ resource "google_firebaserules_release" "default-bucket" {
      ~ create_time  = "2023-08-06T14:30:52.912880Z" -> (known after apply)
      ~ disabled     = false -> (known after apply)
      ~ id           = "projects/saas-starter-a1/releases/firebase.storage/saas-starter-a1.appspot.com" -> (known after apply)
        name         = "firebase.storage/saas-starter-a1.appspot.com"
      ~ ruleset_name = "projects/saas-starter-a1/rulesets/f9f8ae3a-6c98-42dc-8b27-0b9d7d02313e" -> (known after apply)
      ~ update_time  = "2023-08-06T14:30:52.912880Z" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # google_firebaserules_release.firestore will be replaced due to changes in replace_triggered_by
-/+ resource "google_firebaserules_release" "firestore" {
      ~ create_time  = "2023-08-06T14:30:35.340067Z" -> (known after apply)
      ~ disabled     = false -> (known after apply)
      ~ id           = "projects/saas-starter-a1/releases/cloud.firestore" -> (known after apply)
        name         = "cloud.firestore"
      ~ ruleset_name = "48069a00-baab-4454-b3c5-d517f816a142" -> (known after apply)
      ~ update_time  = "2023-08-06T14:30:35.340067Z" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # google_firebaserules_ruleset.firestore must be replaced
-/+ resource "google_firebaserules_ruleset" "firestore" {
      ~ create_time = "2023-08-06T14:30:32.593826Z" -> (known after apply)
      ~ id          = "projects/saas-starter-a1/rulesets/48069a00-baab-4454-b3c5-d517f816a142" -> (known after apply)
      ~ metadata    = [
          - {
              - services = [
                  - "cloud.firestore",
                ]
            },
        ] -> (known after apply)
      ~ name        = "48069a00-baab-4454-b3c5-d517f816a142" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ source {
          ~ files {
              ~ content = <<-EOT # forces replacement
                  - rules_version = '2';
                  - 
                  - service cloud.firestore {
                  -   match /databases/{database}/documents {
                  -     match /{document=**} {
                  -       allow read, write: if false;
                  -     }
                  -   }
                  + rules_version = '2';
                  + 
                  + service cloud.firestore {
                  +   match /databases/{database}/documents {
                  +     match /{document=**} {
                  +       allow read, write: if false;
                  +     }
                  +   }
                    }
                EOT
                name    = "firestore.rules"
            }
        }
    }

  # google_firebaserules_ruleset.storage must be replaced
-/+ resource "google_firebaserules_ruleset" "storage" {
      ~ create_time = "2023-08-06T14:30:49.605711Z" -> (known after apply)
      ~ id          = "projects/saas-starter-a1/rulesets/f9f8ae3a-6c98-42dc-8b27-0b9d7d02313e" -> (known after apply)
      ~ metadata    = [
          - {
              - services = [
                  - "firebase.storage",
                ]
            },
        ] -> (known after apply)
      ~ name        = "f9f8ae3a-6c98-42dc-8b27-0b9d7d02313e" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ source {
          ~ files {
              ~ content = <<-EOT # forces replacement
                  - rules_version = '2';
                  - 
                  - service firebase.storage {
                  -   match /b/{bucket}/o {
                  -     match /{allPaths=**} {
                  -       allow read, write: if
                  -           request.time < timestamp.date(2023, 8, 20);
                  -     }
                  -   }
                  + rules_version = '2';
                  + 
                  + service firebase.storage {
                  +   match /b/{bucket}/o {
                  +     match /{allPaths=**} {
                  +       allow read, write: if
                  +           request.time < timestamp.date(2023, 8, 20);
                  +     }
                  +   }
                    }
                EOT
                name    = "storage.rules"
            }
        }
    }

Plan: 4 to add, 0 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pusher: @devomr, Action: `pull_request`, Working Directory: ``, Workflow: `SaaS Starter Deployment`*